#ifndef _NTC_DRV_H_
#define _NTC_DRV_H_


/**
***********************************************************
* @brief 传感器硬件初始化
* @param
* @return 
***********************************************************
*/
void TempDrvInit(void);
void TempDrvTest(void);

/**
***********************************************************
* @brief 生产温度数据
* @param
* @return 
***********************************************************
*/
void TempDataProc(void);

/**
***********************************************************
* @brief 获取温度传感器数据
* @param
* @return 温度数据，小数
***********************************************************
*/
float GetTempData(void);
#endif
